In [26]:
import csv
import pandas as pd
import datetime
import strptime

ModuleNotFoundError: No module named 'strptime'

In [3]:
path = "Chicago_calendar.csv"

In [6]:
df1 = pd.read_csv(path)

In [7]:
df1.head()

   listing_id        date available   price
0      258253  2019-11-14         t  $48.00
1      258253  2019-11-13         t  $48.00
2      258253  2019-11-12         t  $48.00
3      258253  2019-11-11         t  $48.00
4      258253  2019-11-10         t  $48.00

In [10]:
df1 = df1.sort_values(by="date",ascending= True)

In [11]:
df1.head()

         listing_id        date available    price
2771809    29982622  2018-11-15         f      NaN
1836825    24399639  2018-11-15         f      NaN
734435     14529740  2018-11-15         f      NaN
245751      5706620  2018-11-15         t  $150.00
1030645    15495723  2018-11-15         t   $99.00

In [31]:
df1.dtypes

listing_id     int64
date          object
available     object
price         object
dtype: object

In [33]:
df2 = df1
timefmt = "%Y-%m-%d" 
df2['date'] = pd.to_datetime(df2['date'], format = timefmt, errors='coerce')

In [34]:
df2.head()

         listing_id       date available    price
2771809    29982622 2018-11-15         f      NaN
1836825    24399639 2018-11-15         f      NaN
734435     14529740 2018-11-15         f      NaN
245751      5706620 2018-11-15         t  $150.00
1030645    15495723 2018-11-15         t   $99.00

In [46]:
df2 = df2.loc[df2['date']>'2019-01-01' ,:]
df2.head()

         listing_id       date available    price
1525021    21814029 2019-01-02         t  $675.00
1299139    20539574 2019-01-02         f      NaN
2331937    27757520 2019-01-02         t   $29.00
1073948    18340097 2019-01-02         f      NaN
2010473    25781389 2019-01-02         f      NaN

In [43]:
df3 = df2.loc[df2['date']<'2019-01-31' ,:]
df3.head()

         listing_id       date available    price
2771809    29982622 2018-11-15         f      NaN
1836825    24399639 2018-11-15         f      NaN
734435     14529740 2018-11-15         f      NaN
245751      5706620 2018-11-15         t  $150.00
1030645    15495723 2018-11-15         t   $99.00